Show / Hide Table of Contents
Class PointOnLine3D
Represents a Point dependent on the line in three-dimensional space.
Inheritance
System.Object
OpenObject
OpenElementId
PointOnLine3D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.PointOnLine3D,CI.Geometry3D", "CI.Geometry3D.IPointOnLine3D,CI.BasicTypes")]
public class PointOnLine3D : OpenElementId
Properties
Improve this Doc   View Source
Geometry
Gets or sets the reference to PolyLine3D line or Segment3D segment.
Declaration
public ReferenceElement Geometry { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
IsFromStart
Gets or sets the position value is measured from the start or the ent of the line.
Declaration
public bool IsFromStart { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsRelative
Gets or sets absolute or relative representation of the position value.
Declaration
public bool IsRelative { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Position
Gets or sets the position value on the line.
Declaration
public double Position { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source